const btn = document.querySelector("button");
var d = new Date();
var day;
var dayCount = d.getDay();
var trainCount = -1;

var textResult = document.getElementById("result");


var minut = [];
var timme = [];
var time = [];
var parsedHour = [];
var parsedMinute = [];

var stationes = ['Moreno','La Reja', 'Francisco Álvarez', 'Ing. P. P. Marín', 'Las Malvinas', 'General Rodriguez', 'La Fraternidad', 'Lezica y Torrezuri', 'Univ. de Luján', 'Luján', 'Jáuregui', 'Olivera', 'Gowland', 'Mercedes'];

var tidtabell = [
    // monday
    [
        [[215,323,437,550,658,811,925,1033,1145,1300,1408,1519,1635,1743,1853,2013,2128,2230],[529,637,751,904,1012,1125,1239,1347,1459,1614,1722,1833,1949,2057,2207,2327]],    //Moreno
        [[221,329,443,556,704,817,931,1039,1151,1306,1414,1525,1641,1749,1859,2019,2134,2236],[523,631,745,858,1006,1119,1233,1341,1453,1608,1716,1827,1943,2051,2201,2321]],    //La Reja
        [[226,334,448,601,709,822,936,1044,1156,1311,1419,1530,1646,1754,1904,2024,2139,2241], [518,626,740,853,1001,1114,1228,1336,1448,1603,1711,1822,1938,2046,2156,2316]],  //Francisco Alvarez
        [[231,339,453,606,714,827,941,1049,1201,1316,1424,1535,1651,1759,1909,2029,2144,2246 ],[513,621,735,848,956,1109,1223,1331,1443,1558,1706,1817,1933,2041,2151,2311 ]],    //Ing. P.P. Marín
        [[235,343,457,610,718,831,945,1053,1205,1320,1428,1539,1655,1803,1913,2033,2148,2250 ],[509,617,731,844,952,1105,1219,1327,1439,1554,1702,1813,1929,2037,2147,2307,2358]],    //Las Malvinas
        [[241,349,503,616,724,837,951,1059,1211,1326,1434,1545,1701,1809,1919,2039,2154,2256 ], [503,611,725,838,946,1059,1213,1321,1433,1548,1656,1807,1923,2031,2141,2301,2352]],    //General Rodriguez
        [[246,354,508,621,729,842,956,1104,1216,1331,1439,1550,1706,1814,1924,2044,2159,2301 ],[458,606,720,833,941,1054,1208,1316,1428,1543,1651,1802,1918,2026,2136,2256,2347]],    //La Fraternidad
        [[252,400,514,627,735,848,1002,1110,1222,1337,1445,1556,1712,1820,1930,2050,2205,2307 ],[452,600,714,827,935,1048,1202,1310,1422,1537,1645,1756,1912,2020,2130,2250,2341]],    //Lezica y Torrezuri
        [[256,404,518,631,739,852,1006,1114,1226,1341,1449,1600,1716,1824,1934,2054,2209,2311 ],[448,556,710,823,931,1044,1158,1306,1418,1533,1641,1752,1908,2016,2126,2246,2337]],    //Univ. de Luján
        [[300,408,522,635,743,856,1010,1118,1230,1345,1453,1604,1720,1828,1938,2058,2213,2314 ], [445,553,707,820,928,1041,1155,1303,1415,1530,1638,1749,1905,2013,2123,2243,2334,2358]],  //Luján
        [[309,417,531,644,752,905,1019,1127,1239,1354,1502,1613,1729,1837,1947,2107,2222,null],[435,543,657,810,918,1031,1145,1253,1405,1520,1628,1739,1855,2003,2113,2233,null,2348]],    //Jáuregui
        [[320,428,542,655,803,916,1030,1138,1250,1405,1513,1624,1740,1848,1958,2118,2233,null],[424,532,646,759,907,1020,1134, 1242,1354,1509,1617,1728,1844,1952,2102,2222,null,2337]],    //Olivera
        [[331,439,553,706,814,927,1041,1149,1301,1416,1524,1635,1751,1859,2009,2129,2244,null],[413,521,635,748,856,1009,1123,1231,1343,1458,1606,1717,1833,1941,2051,2211,null,2326]],    //Gowland
        [[342,450,604,717,825,938,1052,1200,1312,1427,1535,1646,1802,1910,2020,2140,2255,null], [402,510,624,737,845,958,1112,1220,1332,1447,1555,1706,1822,1930,2040,2200,null,2315]]   //Mercedes
    ],
    // the other working days
    [
        [[215,323,437,550,658,811,925,1033,1145,1300,1408,1519,1635,1743,1853,2013,2128,2230],[529,637,751,904,1012,1125,1239,1347,1459,1614,1722,1833,1949,2057,2207,2327]],    //Moreno
        [[221,329,443,556,704,817,931,1039,1151,1306,1414,1525,1641,1749,1859,2019,2134,2236],[523,631,745,858,1006,1119,1233,1341,1453,1608,1716,1827,1943,2051,2201,2321]],    //La Reja
        [[226,334,448,601,709,822,936,1044,1156,1311,1419,1530,1646,1754,1904,2024,2139,2241], [518,626,740,853,1001,1114,1228,1336,1448,1603,1711,1822,1938,2046,2156,2316]],  //Francisco Alvarez
        [[231,339,453,606,714,827,941,1049,1201,1316,1424,1535,1651,1759,1909,2029,2144,2246 ],[513,621,735,848,956,1109,1223,1331,1443,1558,1706,1817,1933,2041,2151,2311 ]],    //Ing. P.P. Marín
        [[235,343,457,610,718,831,945,1053,1205,1320,1428,1539,1655,1803,1913,2033,2148,2250 ],[509,617,731,844,952,1105,1219,1327,1439,1554,1702,1813,1929,2037,2147,2307,2358]],    //Las Malvinas
        [[241,349,503,616,724,837,951,1059,1211,1326,1434,1545,1701,1809,1919,2039,2154,2256 ], [503,611,725,838,946,1059,1213,1321,1433,1548,1656,1807,1923,2031,2141,2301,2352]],    //General Rodriguez
        [[246,354,508,621,729,842,956,1104,1216,1331,1439,1550,1706,1814,1924,2044,2159,2301 ],[458,606,720,833,941,1054,1208,1316,1428,1543,1651,1802,1918,2026,2136,2256,2347]],    //La Fraternidad
        [[252,400,514,627,735,848,1002,1110,1222,1337,1445,1556,1712,1820,1930,2050,2205,2307 ],[452,600,714,827,935,1048,1202,1310,1422,1537,1645,1756,1912,2020,2130,2250,2341]],    //Lezica y Torrezuri
        [[256,404,518,631,739,852,1006,1114,1226,1341,1449,1600,1716,1824,1934,2054,2209,2311 ],[448,556,710,823,931,1044,1158,1306,1418,1533,1641,1752,1908,2016,2126,2246,2337]],    //Univ. de Luján
        [[300,408,522,635,743,856,1010,1118,1230,1345,1453,1604,1720,1828,1938,2058,2213,2314 ], [445,553,707,820,928,1041,1155,1303,1415,1530,1638,1749,1905,2013,2123,2243,2334,2358]],  //Luján
        [[309,417,531,644,752,905,1019,1127,1239,1354,1502,1613,1729,1837,1947,2107,2222,null],[435,543,657,810,918,1031,1145,1253,1405,1520,1628,1739,1855,2003,2113,2233,null,2348]],    //Jáuregui
        [[320,428,542,655,803,916,1030,1138,1250,1405,1513,1624,1740,1848,1958,2118,2233,null],[424,532,646,759,907,1020,1134, 1242,1354,1509,1617,1728,1844,1952,2102,2222,null,2337]],    //Olivera
        [[331,439,553,706,814,927,1041,1149,1301,1416,1524,1635,1751,1859,2009,2129,2244,null],[413,521,635,748,856,1009,1123,1231,1343,1458,1606,1717,1833,1941,2051,2211,null,2326]],    //Gowland
        [[342,450,604,717,825,938,1052,1200,1312,1427,1535,1646,1802,1910,2020,2140,2255,null], [402,510,624,737,845,958,1112,1220,1332,1447,1555,1706,1822,1930,2040,2200,null,2315]]   //Mercedes
    ],
    // feriado
    [
        [[437,550,658,811,925,1033,1145,1300,1408,1519,1635,1743,1853,2013,2128,2230],[751,904,1012,1125,1239,1347,1459,1614,1722,1833,1949,2057,2207,2327]],    //Moreno
        [[443,556,704,817,931,1039,1151,1306,1414,1525,1641,1749,1859,2019,2134,2236],[745,858,1006,1119,1233,1341,1453,1608,1716,1827,1943,2051,2201,2321]],    //La Reja
        [[448,601,709,822,936,1044,1156,1311,1419,1530,1646,1754,1904,2024,2139,2241], [740,853,1001,1114,1228,1336,1448,1603,1711,1822,1938,2046,2156,2316]],  //Francisco Alvarez
        [[453,606,714,827,941,1049,1201,1316,1424,1535,1651,1759,1909,2029,2144,2246 ],[735,848,956,1109,1223,1331,1443,1558,1706,1817,1933,2041,2151,2311 ]],    //Ing. P.P. Marín
        [[457,610,718,831,945,1053,1205,1320,1428,1539,1655,1803,1913,2033,2148,2250 ],[731,844,952,1105,1219,1327,1439,1554,1702,1813,1929,2037,2147,2307,2358]],    //Las Malvinas
        [[503,616,724,837,951,1059,1211,1326,1434,1545,1701,1809,1919,2039,2154,2256 ], [725,838,946,1059,1213,1321,1433,1548,1656,1807,1923,2031,2141,2301,2352]],    //General Rodriguez
        [[508,621,729,842,956,1104,1216,1331,1439,1550,1706,1814,1924,2044,2159,2301 ],[720,833,941,1054,1208,1316,1428,1543,1651,1802,1918,2026,2136,2256,2347]],    //La Fraternidad
        [[514,627,735,848,1002,1110,1222,1337,1445,1556,1712,1820,1930,2050,2205,2307 ],[714,827,935,1048,1202,1310,1422,1537,1645,1756,1912,2020,2130,2250,2341]],    //Lezica y Torrezuri
        [[518,631,739,852,1006,1114,1226,1341,1449,1600,1716,1824,1934,2054,2209,2311 ],[710,823,931,1044,1158,1306,1418,1533,1641,1752,1908,2016,2126,2246,2337]],    //Univ. de Luján
        [[522,635,743,856,1010,1118,1230,1345,1453,1604,1720,1828,1938,2058,2213,2314 ], [707,820,928,1041,1155,1303,1415,1530,1638,1749,1905,2013,2123,2243,2334,2358]],  //Luján
        [[531,644,752,905,1019,1127,1239,1354,1502,1613,1729,1837,1947,2107,2222,null],[657,810,918,1031,1145,1253,1405,1520,1628,1739,1855,2003,2113,2233,null,2348]],    //Jáuregui
        [[542,655,803,916,1030,1138,1250,1405,1513,1624,1740,1848,1958,2118,2233,null],[646,759,907,1020,1134, 1242,1354,1509,1617,1728,1844,1952,2102,2222,null,2337]],    //Olivera
        [[553,706,814,927,1041,1149,1301,1416,1524,1635,1751,1859,2009,2129,2244,null],[635,748,856,1009,1123,1231,1343,1458,1606,1717,1833,1941,2051,2211,null,2326]],    //Gowland
        [[604,717,825,938,1052,1200,1312,1427,1535,1646,1802,1910,2020,2140,2255,null], [624,737,845,958,1112,1220,1332,1447,1555,1706,1822,1930,2040,2200,null,2315]]   //Mercedes
    ]
];









const dag = document.getElementById('day');
dag.style.visibility = 'hidden';
const hour = document.getElementById('hour');
hour.style.visibility = 'hidden';
const minute = document.getElementById('minute');
minute.style.visibility = 'hidden';

const options = document.getElementById('showHide');

var llegar;
var ir;

const show = () => {

    const selectValue = options.value;
    llegar = undefined;
    ir = undefined;


    if (selectValue == "llegar") {
        llegar = true;
    } else if (selectValue == "ir") {
        ir = true;
    } 

    if (selectValue == "ir" || selectValue == "llegar") {
        dag.style.visibility = 'visible';
        hour.style.visibility = 'visible';
        minute.style.visibility = 'visible';

        parsedHour = parseInt(hour.value);
        parsedMinute = parseInt(minute.value);
        timme = [];
        minut = [];
        time = [];


        timme.push("0"+hour.value);
        minut.push("0"+minute.value);
        time.push(timme.join('').slice(-2));
        time.push(minut.join('').slice(-2));
        time = parseInt(time.join(""));

     

    } else {
        dag.style.visibility = 'hidden';
        hour.style.visibility = 'hidden';
        minute.style.visibility = 'hidden';

        timme = [];
        minut = [];
        time = [];


        timme.push("0"+ d.getHours().toString());
        minut.push("0"+d.getMinutes().toString());
        time.push(timme.join('').slice(-2));
        time.push(minut.join('').slice(-2));
        time = parseInt(time.join(""));


    }
}



if (dayCount === 0) {
    day = "feriado"
} else if (dayCount === 1) {
    day = "monday"
} else {
    day = "working day"
}




var array = [];
var train = [];
var result;

const viaje = (e) => {

    e.preventDefault();


    const start = document.getElementById("start").value;
    const stop = document.getElementById("stop").value;



    if (dag.value == "tomorrow") {
            dayCount = d.getDay()+1;
            console.log("dayCount: ",dayCount, day);
        } else if (dag.value == "dayAfterTomorrow") {
            dayCount = d.getDay()+2;
            console.log("dayCount: ",dayCount, day);
        } else if (dag.value == "today") {
            console.log("dayCount: ",dayCount, day);
    }


    if (day == "monday") {
            array = tidtabell[0]
        } else if (day == "working day") {
            array = tidtabell[1]
        } else {
            array = tidtabell[2]
    }





    if (Number(start) < Number(stop)) {            // IDA 
        train = [];

        if (llegar) {                             //  LLEGAR
            array[Number(stop)][0].forEach((x) => {

                if (x <= time) {
                    trainCount++;
                    train.push(x);
                    console.log("pushed: ", x)
                }
            })
            
            if (train[0] == undefined) {
                array[Number(stop)][0].forEach((x) => {
                    train.push(x)
                    console.log("kottaraa: ",x);
                })
            }

            console.log(train)

            if (train.pop() == null) {
                result = "OBS! Este tren solo llega a Luján";
                console.log("OBS! Este tren solo llega a Luján")
            }

            result = train.pop().toString().split('');

            if (result.length == 2) {
                result.unshift('0')
            } else if (result.length == 1) {
                result.unshift('0','0')
            }
            result.splice(-2,0,":")

            textResult.innerHTML = [];
            textResult.innerHTML = "El tren viene las "+ result.join('') + " a " + stationes[start];
            console.log("El tren viene las "+ array[Number(start)][0][trainCount] + " a " + stationes[stop]);
            trainCount = -1;

            

        } else {                                    // IR
            array[Number(start)][0].forEach((x) => {
    
                if (x >= time) {
                    train.push(x)
                }
            })
            
            if (train[0] == undefined) {
                dayCount++;
                time = 0;
            
                array[Number(start)][0].forEach((x) => {
                
                    if (x >= time) {
                        train.push(x)
                    }
                })
            }
            result = train[0].toString().split('');

            if (result.length == 2) {
                result.unshift('0')
            } else if (result.length == 1) {
                result.unshift('0','0')
            }
            result.splice(-2,0,":")

            textResult.innerHTML = [];
            textResult.innerHTML = "El tren viene las "+ result.join('') + " a " + stationes[start];
            trainCount = -1;
        }





    } else if (Number(start) > Number(stop)) {
        console.log(array[Number(start)][1])

        
        array[Number(start)][1].forEach((x) => {
    
            if (x >= time) {
                train.push(x)
            }
        })
        
        if (train[0] == undefined) {
            dayCount++;
            time = 0;

        
            array[Number(start)][1].forEach((x) => {
            
                if (x >= time) {
                    train.push(x)
                }
            })
        }
        
        
        var result = train[0].toString().split('');
        
        if (result.length == 2) {
            result.unshift('0')
        } else if (result.length == 1) {
            result.unshift('0','0')
        }
        result.splice(-2,0,":")
        






    } else {
        textResult.innerHTML = [];
        textResult.innerHTML = "Tenes que elegir destinación";
    }
}





options.addEventListener("click", show);
btn.addEventListener("click", show);

btn.addEventListener("click", viaje);

btn.addEventListener("click", () => {
    console.log("time: ", time);
});